[
    "So, it was established before that the Hells are more like a sinner’s paradise rather than a place for eternal torture. With that knowledge I’d like to question the nature of Pali. Is there some universal code in which a god must abide by? Does Pali feel any shame knowing they are rewarding sinners and causing a cycle of evil on top of the already-existing evil generated by mortals themselves? Are the gods just psychopaths? I’m really interested.",
    "are the hells even an afterlife for sinners or whatever or just kindof an eternal blood war shitty place?",
    "The Hells are an afterlife for sinners. It is the place where all things of evil are inexorably drawn towards. When a mortal dies, they are sent to the Shadowfell to be judged by Pali, where each soul is judged for their deeds, worship of a deity, and following of a deity's creed (regardless of worship) in order for their soul to be transported to an appropriate afterlife.The judgement can also be influenced by the presence of extraplanar entities of afterlife planes who can attempt to lull beings to either a deity's afterlife or the Hells before the soul is judged (i.e. in the waiting line). Think of the devil and angel on your shoulders, but quite literal. Also, people can be immediately sent to the Hells if their soul is destined for it (like say, in a fiendish deal)",
    "Do the Gods have drawn symbols?",
    "Yes. I really should put that in the Lore doc for the Gods. The Gods have symbols that represent them, often more than one but are fairly simple to pick out. Gali: A sunburst, a lion's head (often mid-roar), a flaming sword. Arcti: A snowflake, the silhouette of a white bird (often a snow owl), a scroll of arcane text. Eni: A gilded plant (often vines, leaves, or branches), a ram's horns (often on a vague shape of a head), a pair of rabbit's ears (also often on a vague shape of a head). Bonti: A bundle of straw or grain, a bull's head and horns, a raven's feather. Pali: A veiled skull (i.e a skull with a veil imposed ontop of it), a silvery circle/sphere (representing the moon), a scythe. Shadowbound: Any hidden object (e.g. A dagger), lucky objects (e.g. Coins). These vary the most as they are icons to a deceitful God, intention matters far more*. Hori: An hourglass, a dragon's head with wide eyes, a pearl. Nym: A set of scales, a female face with closed eyes and a third eye open on her forehead (very rare), a woman with a blindfold over her eyes.",
    "This is assuming that Pali is sending there to be with like-minded individuals. Yes, they are sending evil people into a pit with other evil people, but not all evil people are willing to work together. If three mob bosses are forced to work together, they may for a time, but eventually will all try and back-stab each other to cement one of them as the single head of the crime family. This is actively reflected with the struggles of archfiends fighting amongst one another for control over the Hells. Everyone wants to be king/queen, and everyone’s willing to kill for it. This extrapolates further into the Blood War: Where the endless hoards of demons must fight against the massive expanses of the infernal legions. Both are large factions and ideologies trying to cement themselves as the truest evil in the multiverse, with no end in sight. This status quo effectively keeps evil stagnant and punishing itself for its own nature – evil beings contending with one another. Furthermore, the Blood War also exists to do two things: 1) The devils must keep the demons at bay, or else they will destroy the rest of the multiverse along with themselves. 2) The demons likewise must keep fighting the devils to continue existing, or else they will all be wiped out by the legions of the devils. ",
    "is pali the god you would pray to about the dead? Yep.",
    "Arcti is the God of knowledge right? Knowledge, magic, and storms.",
    "The Gods of the multiverse are entities of great power that tend to control or encompass some aspect(s) of mortal existence. Most deities have existed since the dawn of creation - the inception of free thought and concept.",
    "The Gods of Lorone, like all deities, control a portfolio of aspects that they hold interest and power in. Theirs being numerous and rarely overlapping due to their few numbers. Likewise, many have materials that originate from their own planes of dominion, bestowed upon mortals in miracle-like fashion. A mortal would be lucky to see even an ingot worth of these materials in their lifetime; and even less likely own an item forged or imbued with one.",
    "“The Shadowbound” (Secret 6th) God’s shrines are never so obvious, hidden in plain sight. This is due to their worship being considered heresy by other faiths, and the world at large - though whether this was instigated by the hidden God themselves is unknown. But some believe this functions as a safety measure against revealing their existence.",
    "Nym",
    "Joeri",
    "Bonti",
    "Eni",
    "Pali",
    "Hori",
    "Shadowbound",
    "Hidden God",
    "Murder God",
    "Gali",
    "Arcti"
]