[
    "Are there any book in the library on sorcerer origins? Yes, but given this is not a magical university they would not be written to imply the specific subclasses we know and would probably talk more about what sorcery is and what the gift of magic is.",
    "fabricated on demand? so is like some of the stuff in the shop things that were recovered and researched? Any magic item that is sold to someone is made by the guild artificer using the recovered item as a basis, so it's not the same item. Especially important if the original was made through evil means or was cursed.",
    "Is it flavoured that Grehg prepares all meals when they’re ordered, or are there like, ready-made meals on the side that people can just scoop up? He serves all customers but some meals are in pots.",
    "How much would it cost to build a small brewery in the workshop? A distillery already exists and can be used. But yes, brewer's supplies is good",
    "yo uh, the Temple of Pali is staffed in the day right? Yes as all temples are",
    "How far is the training ground from the main guildhall? I imagine it has the shortest distance, so about less than a minute walk. I imagine Ailwin keeps the training ground in sight from his place of work",
    "Here’s a question that just occurred to me: character-lore wise, where tf do we all live? Does the wyrmslayers guildhouse has rooms we rent or does part of our quest income go to housing? There's a barracks that the adventurers live in. Current idea is that it's kinda like halls/dorms.",
    "Do the wyrmslayers offer resurrection services?",
    "Quest",
    "Wyrmslayers",
    "Ailwin Diswun",
    "Grehg",
    "Tesru Luinam (Guild Artificer)",
    "The Wyrmslayers actively receive shipments from its allies in Pandamonia and Vikyra, allowing them to remain well stocked on every mundane item that an adventurer could need or want.",
    "Okay I'm confused about the magic item loot rolls. Like are they the magic items I'm allowed to have available for players to find on the quest or are they just the magic items that become unlocked for people to buy after the quest? The former. They are magic items that you are allowed to include in your session as loot. Once a player finds the magic item as loot, ideally you make them find it as scraps from battle or a blueprint because they should not be able to use it or own it. You should have the players bring the looted magic item back to the Wyrmslayers so that the company can fabricate new versions of that item for purchase by the guild.",
    "I've given Prospero the sword Lach gave him. If I recall correctly Jeremy said that Lach hasn't actually paid for it yet, how are we going about that one? One of you needs to buy a longsword with money, since you can't own an object from a quest and use it in a mechanical manner.",
    "So how does 'applying' to go on a quest work? Do we just like put a reaction on the post and it's first come first serve or do we DM the DM and they pick who they want?",
    "Presently, the system will work like this: A DM posts a quest, Players must then make replies to that quest saying they want to join, If there are too many players, those players can either be put into another game with too few players or will unfortunately have to sit out because first-come-first-serve. The DM should not decide who is in their game, because we want to be nice and fair to everyone without bias.",
    "These adventures all initially take place in the Dragon Lands, with the guildhall of the Wyrmslayers mercenary company situated near the coast of the border of Skeles and Pholotthu. That being said, quests can range from anywhere in Lorone and beyond should the DM want to run a quest in another location, but odds are they all start at the Wyrmslayer's Guildhall."
]