[
    "If Gaius tool the lucky feat and used tides of Chaos could he essentially give himself triple advantage on a roll, then use his soc reroll to get quadruple advantage? Because he gets advantage from tides, then lucky lets him roll an additional d20 (it doesn't give him advantage so the effect can stack with advantage) then if 3d20s fail he can roll an additional d20 with a soc point?",
    "So, this is actually a really great example of how dice replacement works. But you're effectively right. To clarify totally how it works, if you have advantage on a roll and use the lucky feat, the feature states you are effectively just choosing which of the numbers are used for the advantaged roll. For example: I have advantage and roll a 10 and a 4 on the 2d20. I then use Lucky before modifiers are applied to roll an additional 1d20 and roll a 5. Now that the 3d20 have been rolled you must choose which d20 to use for the advantaged roll (which are 2d20 taking the highest). I choose 10 and 5, discarding the 4. Assuming 10 fails, you may now reroll one of the 2d20 rolled. I roll a 15 and replace the 10 of the 10 and 5 rolled with advantage. The 15 is taken and all modifiers are applied. The same is applied with disadvantage. Lucky does not replace the entire roll, it just allows you to replace 1d20 of the 2d20 rolled for the disadvantaged roll. Magical Guidance is the same if you still failed, rerolling one die and replacing a value previously rolled ",
    "So just a random question totally unrelated to anything, would it be possible to pay Balthazar to put a glyph of warding on something as a wizardly service?",
    "Absolutely, it would be a viable spellcasting service you can request as per the Player's Guide. It would cost 490 gp for a 3rd level Glyph of Warding. If you choose the Spell Glyph function you must supply additional payment for the other spell cast into the Glyph. The calculation for spell pricing is written in the 'Rules on Services' section under Spellcasting Services in the Player's Guide. I have a hunch I know where this is going though, so I'll add a reminder about a restriction of Glyph of Warding in that the item warded cannot move more than 10 feet from where the spell was cast or the glyph is broken without the spell being triggered (with exception to the glyph's trigger being 'if this item is moved from its spot'). The item warded must be stationary.",
    "For the puroses of meeting Feat requirements Do the Fizban's dragonborn count as Dragonborns? It's a good question. For the purposes of LASaga and common sense, yes, they are dragonborn. By stupid pedantic wording, you could twist they are not because they are specifically named and NOT subraces of dragonborn. Much like how the subraces of elf (e.g. high elf and drow) fit into the prerequisite of Elven Accuracy.",
    "if i have the fighting style two-weapon fighting do i need to change the roll for the second attack? No, since now both of your weapons add your ability modifier to damage. You can just roll the weapon as normal",
    "Can you grapple a target more than once? And if you can does that mean they gotta break out twice? One creature cannot grapple the same creature more than once. One creature can grapple MORE THAN ONE creature so long as they have the free hands to do so. Multiple creatures can grapple the same creature more than once. The grappled creature must make a separate attempt against EACH grapple.",
    "Could I buy a 10gp Arcane focus and flavour it as a ring? Yes, you must still abide by the rules of holding it though, and being disarmed.",
    "So there is absolutely no situation in which a PC criminal who isn't a rogue would ever know theives cant? By RAW, pretty much. Take a level in rogue. Thieves' can't is a class feature, not a language.",
    "is there any country in lorone with a tiefling presence? Vikyra, especially Vikyron."
]