[
    "is there like, canon chariot racing (not playable because that's dumb. i just mean in the lore)? Chariot racing, horse racing, running racing, boat racing, obstacle course racing, etc. Chariot racing would be mainly contested between Jaspadi, a desert place ruled by rich traders and slavers, and the Light Kingdom and Storm Kingdom Pandamonia.",
    "So, it was established before that the Hells are more like a sinner’s paradise rather than a place for eternal torture. The Hells are really both a paradise and an eternal torture. It is a sinner’s paradise. But only for the strongest sinners. The infernal hierarchy for example is awful to be in, where everyone below the rank of archdevil is eternally in service to those above them. You pretty much must work for eternity at the hope of promoting to escape your rank and promote to have a better existence, but odds are you’ll never promote to become an archdevil because what archdevil would want to be deposed? It’s why so many fiends are so afraid of demotion. Devils function on a pyramid scheme that has never ended. Demons on the opposite end of the lawful-chaotic axis work on anarchy laws with the strongest being the leaders while the weak suffer and follow the strong to someday become strong. But on the flip-side. The manipulations of fiends can be good for mortal sinners because they get a chance to be saved by their dark entities by consigning themselves to their service – effectively shunting them into the infernal hierarchy early before their own death. Thus, this sinner would serve their master and get a chance for a head start instead of starting at the very bottom of the hierarchy. In a cosmic sense, they started from the bottom and promoted the normal way, just when they were a mortal instead of being a least fiend. The fiends have been at this for a long time, and even cosmic laws can be bent.",
    "Inavastu is basically Venice but with more trees right? Like the place is covered in canals and rivers. That’s kinda how I imagine it",
    "uh... which country would be most likely to hold like... and underground punk/emo scene? Vikyra definitely.  Next would probably be Pandamonia, mostly the Venom and Shadow Kingdoms (they oppose the ideals of elegance of their neighbours, the Storm and Light kingdoms), since there's bound to be people who oppose the idea of peace, tranquillity, and elegance. Though, funny enough there is a very popular model/actress in the Light Kingdom who is probably known for more gothic/darker fashions, bringing about an opposing take on the pristine look of Light Kingdom fashion. (I imagine Donna doesn't go by her real name and doesn't reveal her true nature, though I imagine she's still probably relatively famous). Maybe even Pholotthu, but that's probably just artists being defiant of what constitutes art/fashion.",
    "You got any holidays unrealated to meat space celebrations? There's the 31st of Eni, or Sarinthia's Day. The day to mark the death of Sarinthia Celeste, daughter of Nym. It is a prominent day in the Nymist faith and is day a day off mourning for most religious folk - especially those who worship good ideals. Most pay honour to Sarinthia by shedding no blood and causing no trouble, as her murder was a tragedy felt across all the realm. To commit crime on this day is a grievous matter and often subject to failure, due to the vigilance of the church of Nym on this day. Some say divine intervention takes place to ensure the peace.",
    "The Apotheosis of Nym, which takes place on the 32nd of the Gali Tide (Yes coincidentally, 1 tide and 1 day after her daughter died). The day to remember the violent death of Joeri Celeste, who destroyed and killed hundreds of thousands in his wake, and the ascension of Nym, who took his place as a deity, now the Goddess of law and order. Most celebrate this day for the ascension of the Goddess and honor her existence.",
    "How long can dragons live without resorting to lichdom in this setting? Average dragons live for about 1,500 years, 2,000 if they're lucky. But, there are practically no mortal dragons that have lived that long in the setting, so even dragons have difficulty confirming their lifespan. Dracoliches often resort to lichdom to preemptively attain immortality and/or to gain significant magical power ",
    "Is there an Underdark in Lorone? There are large underground cave systems underneath Jaspadi (mostly dotted around), Skeles (mostly under the mountain of Skeletown), and the Shadow Kingdom of Pandamonia. These are often presently used as places of settlement for subterranean civilisations in Lorone, aka the Underdark.",
    "The Shadow Kingdom used to have a full on subterranean society, essentially like an Underdark but condensed. But, a massive earthquake caused that civilisation to be destroyed but some still dwell in the ruins rebuilding. Presently, it is known by Pandamonians as Kyokikofun in traditional Pandamonian dialects, or 'The Tomb of Tragedies' in the common tongue.",
    "Skeles' cave systems led to them encountering aberrations that live underground. Combined with their oppression by giants millennium ago resulted in what would become the Grey Dwarves and Deep Gnomes to evolve and form societies underground, whether as cultists/servants/allies of these aberrations, or as independent skulkers. This deep underground area is known as Dehur Mimm (or the 'Deep Dark' in Dwarvish), and is notoriously dangerous and only adventurers and excavators ever dare traverse into it.",
    "Finally, Jaspadi's subterranean systems are very disconnected and more like underground bases formed from caves and micro-civilisations formed by aberrations, some even used to form hiding spots from the Great War above. These days, creatures with psionic aptitude and nomads often use these caves to form hidden tribes in. All of these have very similar biomes, the usual underdark dark rocky paths, water flowing from the ocean, luminescent plants and fungi, terrifying aberrations, psionics, and subterranean monsters.",
    "-5 CA, aka the Darthaspawn Crisis. During this period, the King of Vikyra, Lancelot Philips and his archwizard were assassinated, with the Cult of Dartha - a cult dedicated to the worship of an evil Lich and the main antagonist of the Great War (occurring 2,000 years before this) - claiming responsibility for the act.",
    "The Heroes of Lorone and the Lorone Alliance. While Dartha himself was incredibly powerful, being compared to a demigod or a creature becoming as powerful as a God, the Heroes (who total to 7 people) became almost as powerful as he was.",
    "The Ascension of the Law Gods (0 CA). a powerful wizard, and apprentice of Joeri Celeste, named Brohn Silverwile became the God of law and order. In a show of power, he cast a powerful magical effect over all of the Material Plane, an enchantment that affected every creature and force on the plane: 'All crime, evil, and unlawful acts are impossible to perform, willingly or otherwise. Lest you be struck down by the Light of Judgement.'",
    "At the conclusion of the Great War (0 PGW or -2000 CA/-2024 CA) against Dartha the Lich King, many powerful spellcasters and millions of magical creatures were slain. Many magical items were created, lost, and destroyed over the course of the war as well. Magic became feared for the horrors it could commit, as the Lich King had done throughout the horrible war. In addition, the deaths of so many magical creatures and objects had caused magic to become more unstable throughout Lorone’s Material Plane, resulting in the sporadic presence of Wild Magic Zones and Dead Magic Zones throughout the plane for milenia.",
    "Vikyra",
    "Drania",
    "Blanksee",
    "Jaspadi",
    "Vuchigua",
    "Gofril",
    "Spuc Wa",
    "Dragon Lands",
    "Skeles",
    "Pholotthu",
    "Pandamonia",
    "Material Plane",
    "Astral Sea",
    "Lorone"
]