{
    "gods": {
        "Is there some universal code in which a god must abide by? Does Pali feel any shame knowing they are rewarding sinners and causing a cycle of evil on top of the already-existing evil generated by mortals themselves? Are the gods just psychopaths? I’m really interested.": "There are many universal codes the Gods abide by. They are not the only ones who must abide by rules, all creatures must in the end. Devils must obey a universal law known as the Pact Primeval by which their powers to form pacts stems and is also why they can’t just force you to sign a piece of paper but must convince you to sign willingly despite the consequences."
    },
    "worldbuilding": {
        "What is the process an evil mortal soul goes through to become a devil/demon?": "It’s often not really talked about in the context of PCs because we never like to think about it and because PCs are so cool making deals with fiends and stuff. But, whenever a soul is sent to the Hells by Pali, they get sent from the Shadowfell to the Hells via the River Styx, which wipes your mind, experiences, and personality away leaving only the fundamental parts – effectively, getting rid of everything but your evil nature. After spawning from the Styx you also come out of a least devil. Though this process can be resisted or altered by exceptionally powerful evil souls, either retaining more of their personality or more of their power, allowing them to promote faster out the gate."
    },
    "mechanics": {
        "Okay so like I think I've confused myself. If I wanted say, a homunculus, to give me the Help action to the attack action would it need to be within 5 feet of me or my target?": "You (the one taking the Help action) must be within 5 feet of your target in order for your ally to benefit from your help."
    },
    "LASagaRules": {
        "Would characters be able to like 'source' corpses for spells at the guild, or would we have to find them on quests only?": "There are corpses that can be used for spells. There are bandits out there and they can be just brought in for use like that. Necromancy and the use of blood/corpses in magic is a thing."
    }
}