{
    "gods": {
        "Is there some universal code in which a god must abide by? Does Pali feel any shame knowing they are rewarding sinners and causing a cycle of evil on top of the already-existing evil generated by mortals themselves? Are the gods just psychopaths? I’m really interested.": "There are many universal codes the Gods abide by. They are not the only ones who must abide by rules, all creatures must in the end. Devils must obey a universal law known as the Pact Primeval by which their powers to form pacts stems and is also why they can’t just force you to sign a piece of paper but must convince you to sign willingly despite the consequences.",
        "So I took a look at the Wiki and noticed the bit on old gods. As I understand it, lorone, and it planes are in a little pocket of the astral sea and the 'old gods' are creatures from beyond this bubble. My question would be how exactly do they get in?": "The answer is that they don't. The God of law is the deity that keeps the world of Lorone isolated within the greater multiverse. They keep all the nasties out. Cultists of the Old Gods at most attempt to summon their God or invoke their power. Though this often fails because of the law God. While the law God lives and can exert their power, the Old Gods cannot enter Lorone. Cults to the Old Gods also attempt to replicate the teachings of their God, whether summoning or creating aberrations and psionic creatures.",
        "Aren't there also the like demi-old gods?": "Yes, but most of them are not on threats (the good ones at least). Evil ones are also not on the Material, or are being hunted/killed by the good ones. And other powerful beings.",
        "Arcti is the God of knowledge right? Do they know what you are doing all the time?": "Knowledge, magic, and storms. They may know. They may not. The priests of Blanksee will certainly preach such. Fear and centuries of indoctrination by scripture ensures the system maintains itself",
        "I'm assuming the creatures living in the Underdark know about the overworld and its soft squishy enslavable/sacrificable/delicious inhabitants?": "Often yes. Especially if they are a cult to an Old God.",
        "Okay but how do the cultists find out about these things from beyond Lorone. Surely the Old Gods are able to slip some power through the cracks in reality. Or are they just the dreams of madmen made real through worship koa-toa style?": "Oral history, telepathic history, written records (often shared just in the cult), transplanting information, guesswork through madness/eldritch knowledge. Cults are very few, and mostly spread by aberrations to aberrations. Or carried on through other races they kidnap and indoctrinate. Or by people that survive their experiences with them that go mad.",
        "Are there aliens in Lorone? Creatures living among the stars?": "No. While no one on Lorone knows this (aka out of character), space, the stars, the sun, and the moon are all figments created by the Gods to make it seem like the world is as it always was. It's a big lie.",
        "How long have humanoids been in existance for?": "IC: Humanoids have been kicking since the beginning of their possible history. Written history is best documented about 2000-3000 years ago. Legends tell of ages far before this where tribes were everywhere and the Gods were carving out the world for people. OOC: The world is far older than anyone could possibly know. Lorone as we know it is tens of millenia old (aka when Lorone was separated to create its own multiverse). Before then, Lorone used to be part of a bigger planet and solar system. During this time, the planet was inhabited by empires of humanoids and other creatures, some of whom became very advanced in their understanding of magic but were wiped out by certain deities, some were insignificant, and some were eradicated by wars. Everything after that is effectively a post apocalypse (meaning Lorone is also technically a post apocalyptic world). Very few people in Lorone could possibly know any of this because the Gods and some select nuclear bomb people are historical revisionists and make sure no one knows for their own good.",
        "Do the Gods have drawn symbols?": "The Gods have symbols that represent them, often more than one but are fairly simple to pick out. Gali: A sunburst, a lion's head (often mid-roar), a flaming sword. Arcti: A snowflake, the silhouette of a white bird (often a snow owl), a scroll of arcane text. Eni: A gilded plant (often vines, leaves, or branches), a ram's horns (often on a vague shape of a head), a pair of rabbit's ears (also often on a vague shape of a head). Bonti: A bundle of straw or grain, a bull's head and horns, a raven's feather. Pali: A veiled skull (i.e a skull with a veil imposed ontop of it), a silvery circle/sphere (representing the moon), a scythe. Shadowbound: Any hidden object (e.g. A dagger), lucky objects (e.g. Coins). These vary the most as they are icons to a deceitful God, intention matters far more*. Hori: An hourglass, a dragon's head with wide eyes, a pearl. Nym: A set of scales, a female face with closed eyes and a third eye open on her forehead (very rare), a woman with a blindfold over her eyes",
        "When did Nym come into power and who came before her?": "Nym came in to power around 23 CA. Joeri came to power 0 CA. He's easier to remember since CA started because of him (Celeste Accension). The law God before him was a man named Brohn Silverwile. Prior to 0 CA, there was no law God.",
        "Bonti is a guy right?": "Bonti is predominantly referred to as masculine but can be feminine. He can be anything and is famously a shapechanger in myth.",
        "Was bonti and all the other gods except Nym and Hori kicking about in the PGW era?": "The Pantheon is like this. Prior to -5 CA: Bonti, Eni, Pali, Gali, Arcti, 'Shadowbound'.As of -5 CA: +Hori. As of 0 CA: +Brohn, who was soon replaced by Joeri. As of 23 CA: +Nym, who replaced Joeri.",
        "Yo do does Lorone have equivalent celebrations for stuff like Halloween and Christmas and that sort of thing?": "Arcti's Abstinence (equal to Christmas) is the event where you traditionally remove yourself from all desire, from the 1st day of the Arcti Tide to its 30th day. Traditionalists say you must only eat what is needed, drink no alcohol, and partake in no indulgences. But most only follow the last part, in that you just don't have sex or have any form of sexual relation or relief until the end of the event. On the 31st day, gifts are given between people to celebrate its end. People eat feasts and be merry. Some even say Arcti will reward those who succeed their challenge with blessings of fortune and crop growth through winter.",
        "What about Halloween for the Bonti Tide?": "That equivalent would be the 1st day of the Bonti Tide (which was a while ago now). Probably called as it is, Hallow's Eve. People put up spooky decorations, carve pumpkins, put up wards against ghosts and evil, and dress up as monstrous creatures. This is because on the 1st day of the Bonti Tide (and every tide for that matter, but Autumn is Unseelie and very chaotic), planar portals between the Material Plane and the Feywild often weaken. Thus, fey from Autumn find their ways into the world. Autumn has many hags, redcaps, beasts, and other more tricksy fey that love gifts and wandering. The dressing up, symbolic wards, and spooky appearance of everything makes the possibility of fey scaring people less likely, and makes it so they can't snatch people as easily because you treat them like people who are part of the festivities (fey act like they are treated, if they are guests they often act like them out of politeness). On that, the tradition of 'Trick or Treat' follows that fey-like behaviour of giving and receiving. You give gifts as courtesy to guests, or you are met with a bad fate for your rudeness.",
        "What about holidays specific to the setting?": "There's the 31st of Eni, or Sarinthia's Day. The day to mark the death of Sarinthia Celeste, daughter of Nym. It is a prominent day in the Nymist faith and is day a day off mourning for most religious folk - especially those who worship good ideals. Most pay honour to Sarinthia by shedding no blood and causing no trouble, as her murder was a tragedy felt across all the realm. To commit crime on this day is a grievous matter and often subject to failure, due to the vigilance of the church of Nym on this day. Some say divine intervention takes place to ensure the peace. There is also Heroes' Day, to remember the fallen and celebrating the heroes of what was effectively the most recent loss of mortal life in recent history. Finally, there is the Apotheosis of Nym, which takes place on the 32nd of the Gali Tide (Yes coincidentally, 1 tide and 1 day after her daughter died). The day to remember the violent death of Joeri Celeste, who destroyed and killed hundreds of thousands in his wake, and the ascension of Nym, who took his place as a deity, now the Goddess of law and order. Most celebrate this day for the ascension of the Goddess and honor her existence.",
        "Are any drugs frowned upon in Nymism?": "The more harmful, dangerous and addictive ones, absolutely. Though they wouldn't be that harsh to those that use them (in fact, most good nymists would try to help them recover), but will probably be towards those that deal and profit heavily of them",
        "Can you summarise the sects of Nymism?": "Joerists: generally sympathetic and want to do good things for people to better the world. Brohnists: believe that all criminals are heratics, if you accidentally break the law you are not much better off. Nymists: Strict and to the point, but nice overall."
    },
    "worldbuilding": {
        "Is anyone at war in the setting?": "No, there is not. There aren't any major wars going on as of 100 CA.",
        "What happened in -5 CA?": "-5 CA, aka the Darthan Cult Crisis. During this period, the King of Vikyra, Lancelot Philips and his archwizard were assassinated, with the Cult of Dartha - a cult dedicated to the worship of an evil Lich and the main antagonist of the Great War (occurring 2,000 years before this) - claiming responsibility for the act. In addition, many people throughout the land during this time period (roughly 15 years prior) were blossoming with talents for necromancy magic. The Cult of Dartha and many world intelligence networks discovered that this was linked to the return of the Lich King himself, with these individuals being marked as his spiritual heirs and potential vessels for his return. Dubbed 'Darthaspawn', these people were often disliked out feared for their reputation and power. The appearance of the Darthaspawn, especially so in Vikyra where their strength and number were many, caused the world to fall into a crisis. Word quickly spread that the Lich King would soon return, and that an individual claiming to be Dartha would wage war with Vikyra and siege its capital. Dartha, his cult, and many disillusioned Darthaspawn then sieged Vikyron and overtook it in a day. In a coordinated series of attacks, the cultmanaged to spread its influence across the world. Over the course of approximately half a year, Dartha was stopped and defeated by a group of powerful heroes. These individuals would then be known as the Heroes of Lorone.",
        "What happened after the events of -5 CA?": "The Heroes of Lorone and the Lorone Alliance: While Dartha himself was incredibly powerful, being compared to a demigod or a creature becoming as powerful as a God, the Heroes (who total to 7 people) became almost as powerful as he was. This caused world governments to form pacts and agreements with these powerful individuals in mind. In addition, these same documents and pacts for warfare were also updated in the wake of a crisis that could have matched the Great War in scale. To summarise, the documents were primarily amended to accommodate the state of war and warfare to encompass the power of the Heroes. As each one could likely begin and end wars on their own. This artificially created world peace. Most especially for Vikyra, as many of these Heroes were associated with Vikyra.",
        "Who were the Heroes of Lorone?": "The Heroes of Lorone consisted of: - Alburn Yoop (becomes a janitor, museum custodian, and retired soldier). - Baeorn Davrok (becomes the Lord General/Ruler of Drania who would be succeeded by his son). - Evan Evans (Becomes a Vikyran politician). - Ferroheim Gallifrey (Owner of a popular pub and a defender of Vikyron). - Joeri Celeste (Becomes a Vikyran politician and ascends to Godhood in 0 CA). - Nym Helviani (Becomes a Vikyran politician and succeeds Joeri as God of law in 23 CA after his death). - A man named 'Howard' (Becomes a wandering swordsman and a legend across Lorone for slaying undead). Honorable mentions: - Amo Tentigo (Becomes king of Vikyra and becomes equally as powerful as some of the Heroes after some time).",
        "What happened in 0 CA?": "The Ascension of the Law Gods (0 CA): Though the circumstances are unclear (aka, it's not important to public knowledge) a powerful wizard, and apprentice of Joeri Celeste, named Brohn Silverwile became the God of law and order. In a show of power, he cast a powerful magical effect over all of the Material Plane, an enchantment that affected every creature and force on the plane: 'All crime, evil, and unlawful acts are impossible to perform, willingly or otherwise. Lest you be struck down by the Light of Judgement.' Attempting to perform unlawful acts was henceforth impossible, and repeat offenders were instantly slain by a ray of holy light from Brohn's Tower of the Law God, where he resided on the plane. Brohn's reign was short lived, as a resistance was formed against him consisting of both evil and good forces alike, all seeking to killing the tyrannical God. Joeri Celeste replaced him as God of law, marking the rise of a new deity and solidifying the fears of many world governments. A Hero of Lorone became a God.",
        "Why do no wars happen while the Heroes of Lorone aren't alive?": "Bloodlines of the Heroes: Naturally, the Heroes of Lorone also had children of their own, carrying on their teachings and skills to them. Where the Heroes were comparable to Gods, these children were effectively (or literally in the case of the children of Joeri and Nym) demi-gods in their own right. With the children of these children also being relatively powerful individuals, and so on and so forth. The lineages and legacies of the Heroes (and the events that surround the time periods of their lives) remains throughout Lorone, standing as permanent consequences of seeking to commit wars and acts of destruction. Worldly trauma and fear of overly destructive and powerful creatures, aka why no one wants to do wars (the final bit). To public knowledge in 23 CA, Joeri Celeste died under uncertain circumstances. Some believe it was due to a spread of chaos and cults throughout the world. Joeri's death caused a powerful eruption, not unlike Brohn's Light of Judgement, that slew millions of evil creatures across Lorone. An event that neutered many evil plots throughout Lorone, but also birthing many more. Nym Helviani-Celeste quickly replaced Joeri in the pantheon, but her policies and doctrine are substantially more strict and aggressive against unlawful acts as opposed to Joeri's more kind and heroic doctrine. Finally, the eruption that followed Joeri's death is heavily believed to have damaged the Weave irreversibly. Powerful magic is feared more as a potential collapse to the Weave in its entirety becomes more possible over time.",
        "So if a nation was interested in conquest, they would first need to find a way to deal with the current HMDs (Heros of Mass Destruction) before raising an army?": "Pretty much.",
        "I'm assuming there are aliens out past the astral sea?": "In the world beyond Lorone, at that point you are dealing with total unknowns. Aliens could exist, or they are just gith. They could be mind flayers who are space faring. Or beholders forming colonies on other planets. In other words, read spelljammer it's great and has brilliant lore.",
        "It says in the setting guide that Blanksee is communist right. Is it like communist communist or is it like stalinist totalitariaism? Or when you say communist do you just mean they call eachother Comrad and talk in russian accents": "They're a theocratic state built of the concepts of Arctism, desiring unity among people and an understanding that self worth is useless against a greater whole. A council of powerful mages rules them and most Blanksee citizens are taught to act towards the benefit of Blanksee. Social classes are get much meritocratic. The more useful you are to society as a whole the higher your standing and privilege. A farmer who is incredibly clever and skilled can be more powerful than an apprentice wizard for example. Mages are certainly the ruling class but that's just because they're the most useful type of people for Blanksee. Regardless, community is more important than personal wealth. Everyone gets something but at the same time those who cannot contribute are forced into a position based on a councilman or superior's view of what they can do. For example, a man missing an arm cannot farm but he can read and write so he is forced to be a scribe. If you get too big for yourself, the council's presence will remind you that you matter very little. Dissent is not tolerated and you will be outed and executed by them for it.",
        "How well known is the underdark? Like how much does your average commoner know about it (if anything) and how much does your average adventurer know about it (if anything)": "Average commoner: Nothing. Average adventurer: Nothing or rumours. Average person living in Skeles: They know it's dangerous and that aberrant monsters or weird magic is down there. Average person in the Shadow Kingdom of Pandamonia: They know it's dangerous and that aberrant monsters or weird magic is down there. Average person in Jaspadi: Aware it exists. Average psion in Jaspadi: They know it's dangerous and that psionic creatures probably live down there. Some even hide in there willingly",
        "Is there much pre-existing lore about the feywild in setting?": "https://lorone.fandom.com/wiki/Feywild",
        "so what is the general state of medical science in lorone?": "Not at germ theory or at the level of knowing what a vaccination is. Magic, alchemy, and the booming industry of artifice makes a lot of traditional medical practitioners fairly complacent. A healing potion is a magical potion, the fluid induces magic that causes wounds to be healed through the integration of evocative healing magic directly into an individual, making their body heal faster (and unnaturally mind you) without drawback on physical health or stamina. Yes we know what organs are, the church of Pali - especially in Jaspadi - have practices in embalming. This grants knowledge of organ function and structure.",
        "how days month and year work in Lorone?": "In Lorone there are only 4 months, of which represent the seasons- The Eni Tide (spring), The Gali Tide (summer) , the Bonti Tide (Autumn) and the Arcti Tide. (winter) As a result these 'months' are much larger than our own. They have a similar amount of days as our world, just sprinkled out into larger months/tides, if that makes sense?",
        "Do Dwarven women have beards in this setting": "I think female dwarves should absolutely have beards. Dwarves, especially in Skeles, jokes around foreigners that there are no female dwarves. My personal opinion (so not canon necessarily, so DMs can run worlds opposed to this idea) is that female dwarves have thinner or softer beards. As such, male dwarves who groom their beards can be 'mistaken' for women.",
        "is there any country in lorone with a tiefling presence?": "Vikyra, especially Vikyron. Its current king is a tiefling (Aliver Tentigo), the grandson of a great tiefling king (Amo Tentigo) who replaced the previous royal lineage.",
        "is there any established location to seek higher education, like a university of magic or something?": "There are a fair number. The most famous of all is the Arcane Academy of Vikyron, the most prominent institution of magical education in all of Lorone. The dean is the archmage of Vikyron, Aegis Swiftblade, who is known to be able to cast spells of the 9th level. One of the few in existence that still remains.",
        "How long can dragons live without resorting to lichdom in this setting?": "Average dragons live for about 1,500 years, 2,000 if they're lucky. But, there are practically no mortal dragons that have lived that long in the setting, so even dragons have difficulty confirming their lifespan. Dracoliches often resort to lichdom to preemptively attain immortality and/or to gain significant magical power.",
        "Relative to the Forgotten Realms, what are the Hells/Abyss like in Lorone?": "The gist of it is, there's no Abyss and the Nine Hells is what spawns both devils and demons. The Blood War has them fight each other for dominion over the Hells and as the dominant evil force in the multiverse. Fiends work as you expect in most D&D settings from there. Devils make deals and contracts that try to screw people over and are hyper lawful. Demons are chaotic and often do pacts and deals that involve causing harm and chaos. Yugoloths are in the middle and work as mercenary fiends. The war is mostly fought on the First Layer, Which is the main transient plane of hell, people end up there and travel there first via planar travel. Each Layer is are meant to be named different and have specific information, but they're more or less the same with FR in terms of what they do and who they punish (e.g. first layer is warfare). I'd also like to say the 2nd Layer (currently unnamed) is in a very contentious position. The layer is known for its industry and works as the main supply of weapons throughout the Hells. It's a vast plane with many cities and buildings that are hard to navigate. It is currently heavily contested and the devils could be seen as losing to the Demon Prince: Seyr, Lord of the Agonies. The 4th Layer had been named Avaritia. It is known as the layer of entertainment. Pleasure, entertainment and excess.",
        "Who controls each layer of hell?": "All layers are meant to be in control of the devils. Their superior battle tactics and lawfulness makes them better at holding positions. Demons often do not employ tactics and in fight a lot.  Ocean of demons crashing against a phalanx of devils. Hoards of barbarians against Roman legions.",
        "Where can I find all the info i can get about Pandamonia?": "Pandamonia is split into 6 kingdoms. Ice Kingdom, Fire Kingdom, Light Kingdom, Shadow Kingdom, Venom Kingdom and the Storm Kingdom. https://docs.google.com/document/d/1IvwJzCPQOdUyHjMn0LoJlYWFzgM34bEbkNlGfDTFW1Y/edit. A bit outdated, but the info on the kingdoms of Pandamonia in this is fairly accurate. It does miss some more intricate details from recent history Lorone though (think of this as history as of 100 years ago). The Venom Kingdom is not so oppressive anymore. In this era, it's actually a bit nicer, prettier, and has some fairly famous casinos. Popular for rich tourists but poverty is still a problem - just less of it and way less damning.",
        "People are generally suspicious and afraid of psychics right?": "Only if they know they exist. By 90% of the world's standards, they don't exist or are just labelled 'mages' or 'wizards' because most people don't know any better. The rest know something weird about these 'mind mages' exists, but it's mostly like urban legend or folk tales. Even then, they're confused for some kind of sorcerer (who don't need components)  Then there's the people who actively know they exist and how to define them. But they're often very rare. Dark rumours about psychics circulate especially in places like Jaspadi and Pandamonian folk tales.",
        "Do elven pregnancies last as long as humans?": "Elves gestate as long as humans. Half-elves (along with a fair number of other half-races) are also more prone to infertility.",
        "What was the time period before CA called?": "PGW, or Post Great War. 2000 PGW = 0 CA, Though some historians insist it is 2024 due to inaccuracies in historical events. As a result most people prefer just using negative values for CA from their age or how long ago other events were from the ascension of Joeri (e.g many people hear agree that the Great War ended in -2000 CA).",
        "Elves don't generally get nightmares do they with the whole meditation thing right?": "An elf who trances can dream, but it's by choice and they choose what to dream of - it's more like they're in absolute control of their dreams like lucid dreamers, as their dreams in that state are just mental exercises. So if an elf has a nightmare from a trance, they basically chose to or thought about having a nightmare really hard during their trance. That said, elves can have dreams and nightmares as normal if they just choose to sleep - which they can, but that too is a conscious choice. A 'psychological problem' could cause the elf to gravitate towards having nightmares. So they'd think about it and it would influence their trance.",
        "which country would be most likely to hold an underground punk/emo scene?": "Vikyra definitely. Next would probably be Pandamonia, mostly the Venom and Shadow Kingdoms (they oppose the ideals of elegance of their neighbours, the Storm and Light kingdoms), since there's bound to be people who oppose the idea of peace, tranquillity, and elegance. Though, funny enough there is a very popular model/actress in the Light Kingdom who is probably known for more gothic/darker fashions, bringing about an opposing take on the pristine look of Light Kingdom fashion. (I imagine Donna doesn't go by her real name and doesn't reveal her true nature, though I imagine she's still probably relatively famous). Maybe even Pholotthu, but that's probably just artists being defiant of what constitutes art/fashion.",
        "what's the stigmatization of sex work like around lorone?": "Vikyra: Pretty good. Even prior to the introduction of the Tentigo lineage's laws from King Amo I (aka the Whore King) it was pretty decent with sex work. The idea of sex work is not one that is shied away from in Vikyran society, with the Church of Bonti having a fairly positive relationship with the use of sex and romance as concepts. Pholotthu: Despite being very artistic and romantic, prostitution is not really discussed outside of that romantic outlook. Enism is very casual but dramatic on the subject. It can be kind of toxic with how appealing sex-work can be, but the laws of the land do offer decent protection for sex-workers. Second to Vikyra. Drania: It's okay. There's very much a 'Don't ask, don't tell' attitude to sex work. It exists, but it's certainly not public. Sex-work happens at night, in private establishments, or on-call. Publicly soliciting sex is a no-no and can get you imprisoned. Jaspadi: It is very public as expected of the place that legally allows the ownership of slaves. Anything can be bought and sold for the right money, with the right connections, and the right power. Skeles: Actual sex is very private, despite how often a dirty joke or insult may be had.  Skeles communities, especially the dwarves, gnomes, and halflings, are often private about romantic and sexual matters due to how lawful the society is. Halflings communities especially have a fairly innocent air to them, so sex-work has little place. All in all, what happens behind closed doors stays behind them. Blanksee: Prostitution is illegal. Punishable by heavy fines. Spuc Wa: Prostitution is very common and unregulated. Only slightly worse than Jaspadi in that you can't own a sex-slave. That said, kidnapping and piracy are a thing. Pandamonia: Everywhere is pretty okay with prostitution legally, but publicly frowned upon.  Venom Kingdom is bad at regulation. Ice Kingdom is strict. Gofril: Very much varies from place to place. But there's not really a popularity for prostitution. It certainly exists, but there's not a lot of groundwork for it. More like people just soliciting sex for money. It's fairly open with sex in general, and you can find people just hooking up in fashions almost like Vikyra (how much this is because of its alliance with Vikyra is unknown).",
        "are the hells even an afterlife for sinners or whatever or just kind of an eternal blood war?": "The Hells are an afterlife for sinners. It is the place where all things of evil are inexorably drawn towards. When a mortal dies, they are sent to the Shadowfell to be judged by Pali, where each soul is judged for their deeds, worship of a deity, and following of a deity's creed (regardless of worship) in order for their soul to be transported to an appropriate afterlife. The judgement can also be influenced by the presence of extraplanar entities of afterlife planes who can attempt to lull beings to either a deity's afterlife or the Hells before the soul is judged (i.e. in the waiting line). Think of the devil and angel on your shoulders, but quite literal. Also, people can be immediately sent to the Hells if their soul is destined for it (like say, in a fiendish deal).",
        "Isn't like 10gp a weeks wages for you average unskilled worker?": "10 gp a week is average for a skilled worker. 1 gp a week is a week's wage for someone untrained for their job",
        "When is new years on Lorone? Or does everyone celebrate it at different times": "The end of the Arcti Tide. The beginning of the Eni Tide is the start of the new year.",
        "What is the public impression of the Wyrmslayers?": "I'd say they've been fairly famous from the start thanks to Ailwin's fame, but now there's clear indication that Ailwin has brought in some considerable talents from across the land. Most people just know the legends. Ailwin Diswun, Wandering Swordsman, hero of the realm. But those who actually know Ailwin know what they know."
    },
    "mechanics": {
        "What is the purpose of a component pouch?" : "Characters that have racial spells and actually intend to use them must have a component pouch for spells that have a material component. Very few races actually allow you to cast racial spells and ignore material components, such as the Air Genasi's racial Levitate. This also applies to tertiary casters who cannot use arcane focuses, like Arcane Trickster and Eldritch Knights! Check your components, buy a component pouch if you need any.",
        "Where do we stand on dhampir monk bites? Like I'm aware hard RAW you can't replace the con for dex. But I also know a bunch of DMs RAI it as letting you swap the con for dex.": "We go by RAW here. You cannot replace Constitution for Dexterity using the Martial Arts feature",
        "I was gonna say downtime activities are pretty rare in actual campaigns, like where can we find what options we have?": "Player's Guide in #how-to-play. Under the 'Rules on Downtime Activities' section",
        "hey, so I know there's the healer feat but is there a proficiency in healers kits you can get?": "Healer's Kit is not a proficiency, it is just an item. You use it as an action and it stabilises someone. No medicine check required",
        "how do you add items into my Roll20 character sheet?": "Search for them in the Roll20 compendium (the encircled 'i' icon) and drag and drop the item into your character sheet.",
        "Speaking of buying things. It says in the players guide that all mudane items in the dungeon masters guide are available for players. So how much would it be for a cannon from the seige weapons section?": "A cannon lacks a price so cannot be bought, nor can you craft one.",
        "Does crafting an item yourself actually give you any kind of discount?": "Yes, as per the rules in Xanathar's Guide, you spend half the gold and 1 workweek/50 gp of the item's full price cost. With the time being divided by characters committing to the crafting process. So say, 1 person could spend 750 gold and 30 workweeks to make plate armour. But that could be reduced down to 5 work weeks if you had 3 people work on the same project",
        "More importantly can we buy/craft the renaissance bombs and gunpowder kegs from the DMG? It is definitely an item and it definitely has a cost.": "Ah yes, I should have made an exception. No you cannot. Don't buy any renaissance, modern, or futuristic items that aren't in the firearms doc.",
        "Okay 1 last question definitely not related to all this explosive powder I've been talking about. The rock Gnomes Ticker ability can be used to create a 'Tiny clockwork device' one of which it a firestarter. The fire-starter Quote 'The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action. The fact this device is clockwork suggests to me that you could wind up the firelighter to go off after a delay of say maybe up to a minute or so.": "You can wind up the clockwork device and create a fire from it yes, but no you could not delay its effect since it produces the fire with your action. Meaning you need 3 seconds to create the fire, that does not imply windup time and that implies the flame only lasts 3 seconds, but mostly it just lights other things. It also does not necessarily last for an extended period either since it does not state it lasts a duration. Meaning if you wanted to make a fuse you would have to construct one separately. The Fire Starter just makes a fire. Nothing more.",
        "Since smokepowder is a magical substance, is the damage it deals when it explodes considered magical for the purpose of overcoming resistances for like ghosts and stuff?": "Fire often doesn't require the specification that it is magical to overcome resistance. HOWEVER, if a creature has the magic resistance feature or anything that gives a benefit against a magical effect it would function because smokepowder itself is explicitly magical in nature. So, a yuan-ti for example has advantage on the Dexterity saving throw.",
        "Question regarding crafting. If I wanted to make a bunch of things like bullets could I make a bunch in a 1 week batch assuming the bullets collectively don't cost more than 50gp": "Yes, you can craft multiple batches of items in 1 workweek so long as their selling price (NOT cost of materials you use) does not exceed 50 gp. E.g. With Smith's Tools you could craft 5 shortswords in 1 workweek (50 gp total in selling price), and you spend 25 gold for the materials to make them.",
        "do I need to buy ingredients as well in order to cook or do the cook's utensils just create food?": "Cook's utensils specify you need sufficient food and drink to create a meal. So yes, you need to buy ingredients",
        "Are Dhampire PCs classified as undead? I know they were in the original UA but I haven't actually seen the officially released version": "They are not undead and are not in lore either unless they pursue vampirism (which happens).",
        "Question, anyone have suggestions for a legal grapple sorcerer?": "Human variant -> Take Skill Expert for proficiency and Expertise in Athletics. Max Strength, you don't need Charisma. Clockwork Soul to neutralise enemy advantage against you and to ensure your own tankiness via Restore Balance, Armour of Agathys, and Bastion of Law.  Take Quicken Spell as your metamagic. Twinned Spell can be nice too. Take Enlarge/Reduce to make your Athletics with advantage and one size larger. Game plan every combat: - Quicken Enlarge, main action grapple with advantage. - Subsequent turns, Quicken AoA and main action Blade Cantrip. - Use Magical Guidance to reroll ability checks you fail.- Take Counterspell to help stop mages. Profit.",
        "so uh, RAW I can't booming blade with shadow blade can I?": "You cannot no. It is not a weapon with a monetary cost.",
        "so with starting gear and such, would i add something like armor or would i have to deduct that from my gp?": "If you take starting gear, you get all the items your class allots you along with any items from your background. So for example, when you start fighter, you have to pick items from a sequence. For example: '(a) chain mail or (b) leather armor, longbow, and 20 arrows'. You get what you choose from that first choice of items, no payment needed. But, if you take starting gold (which in the fighter's case is 125), then you get no starting items from your class or background. You just buy what you want.",
        "I Have a purely RP related question (And hope i can explain myself good enough, pesky English language) As Aura is a collage of whispers bard, and i did put 'collects local rumours' on her character sheet, would it be fair to make rolls to check if she  has information about events/conversation she wasnt part off ?(as long as they happened in a place that reasonably could have someone else eavesdrop of course).": "Absolutely. A common skill check for collecting rumours is Charisma (Investigation), formerly 'Streetwise' in older editions. So, roll an Investigation check, but replacing your Intelligence with Charisma instead! The DC for this can vary, but is often along the lines of: DC 10 for basic 'Oh yeah this person was here.' DC 15 for 'Oh I saw these people talk.' DC 20 for 'Oh I saw these people talk and this is the vague emotional feeling of the conversation (e.g. they were angry.)'",
        "Can a non-rogue take theives cant as a language choice?": "No, it is a secret language. The same with Druidic. Not every criminal knows Thieves' Can't because it isn't neccessary in every profession, or every social class. There are high class criminals who wouldn't need thieves' can't because they can just send messages secretly with MONEY Gentleman thieves wouldn't do it either. Not every criminal is a rogue. But many rogues can be criminals.",
        "Could I buy a 10gp Arcane focus and flavour it as a ring?": "Yes, you must still abide by the rules of holding it though. And being disarmed.",
        "How do optional class features work? Do I have to give anything up to take them?": "Not unless they explicitly say so. For example, Rogue's Focused Aim does not replace anything and just says it is optional. But, a Ranger's Favoured Foe replaces Favoured Enemy.",
        "Can you get training in proficiency for specific weapons?": "No, but I think there's certain feats that will give you proficiency with certain weapons. Training is only for tools and languages",
        "For Kensei monks does their bonus action attack from martial arts trigger Agile Parry?": "No, as the bonus action attack from martial arts is not part of the attack action.",
        "So I've looked into this and I thought I'd get the question out the way now. Can you counterspell a counterspell on your turn. I've seen apparently the D&D team have weighed in and said reaction spells are not restricted to the 1 main action spell 1 bonus cantrip  rule but I haven't been able to find the exact source": "You can counterspell a counterspell on your own turn so long as you did not cast a bonus action spell that turn. The bonus action spell rule specifies you cannot cast any spell on that same turn you cast the bonus action spell that is not a cantrip with a casting time of 1 action. Given the specificity of the rule, it does apply even to reactions.",
        "What's the selling rate of stuff we've bought? Can they be sold back for half as much?": "Everything you buy is sold at half price. If a copper piece overflows, round it down (e.g. Half of 5 cp is 2 not 2.5).",
        "Yo, can you grapple/shove off flurry of blows?": "It specifies unarmed sttike for flurry of blows so no.",
        "so not that my roll would change since it's the same modifier, but for trying to act like someone else to seem normal, is that a performance or deception check?": "Deception, given you're trying to activly decieve people. Also that's what the Actor feat covers.",
        "can the same item stack? like 2 stones of good luck or gloves of thievery": "Nope! If any effect would affect a person twice, they only take the more potent effect. This is the case for both spells and magic items. Note this is not the case for similar effects with the same name, it is the name that often matters. I.e. A cloak of protection and a ring of protection stack, but you can't attune and benefit from two rings of protection.",
        "can you extra attack with magic stone?": "You can. Magic stone is not like the blade cantrips in saying that the attack is made as part of the spell, it only says that you can use the stones to attack with. Thus, you are using the attack action to attack with them (and the attack action specifies you make either a ranged or melee attack with it - doesn't matter if it's a weapon or spell attack). The stones can either be used as improvised weapons or as sling ammunition. Though regardless of whether you use a sling or not it uses the spellcasting ability of the caster for the attack and damage rolls. One interesting interaction as well is that if you use a sling to attack with them, you can choose to use the Sharpshooter feat with it. Also, by the wording of 'hurling it with a sling', you can't use the sling as an improvised melee weapon with the magic stone. It would just be an attack with an improvised melee weapon that deals sling damage instead of magic stone damage.",
        "Question, With the fey touched feat, I can cast a 1st spell that I chose on character creation once per long rest. I assume if I use it for free I cast it at 1st level?": "Correct. Unless you expend a spell slot, assume you cast a spell at its lowest level",
        "Can you grapple a target more than once? And if you can does that mean they gotta break out twice?": "One creature cannot grapple the same creature more than once. One creature can grapple MORE THAN ONE creature so long as they have the free hands to do so. Multiple creatures can grapple the same creature more than once. The grappled creature must make a separate attempt against EACH grapple.",
        "Does an unarmed strike need to be made with hands?": "No. Feet. Head. Whatever is fine. As long as it is your own body.",
        "How long is a workday?": "A workday is meant to be 8 hours of time",
        "if you were proficent with them could improvised weapons be counted as monk weapons?": "No, since both Martial Arts and Dedicated Weapon specify what type of weapon they must be. Martial Arts specifies simple weapons or shortswords that are not two-handed or heavy. Dedicated Weapon specifies simple or martial weapons that you are proficient in that are not two-handed or heavy. Improvised weapons are not simple or martial weapons.",
        "Can you counterspell a subtle spell counterspell?": "A spell with no components cannot be countered. If you use the Subtle Spell metamagic and remove all components from it, it cannot be countered and you cannot be identified as the caster unless there is a perceptible component to the spell. A Subtle Counterspell cannot be countered because it only needs somatic components. For contrast a Subtle Fire Bolt cannot be countered but you can be identified as the caster because you visibly 'hurl a mote of fire' as per the spell description. If you use Subtle Spell on a spell with a material component on the other hand, it can be countered because a component of the spell is perceptible (you're only removing verbal and somatic, not material components). I elaborate on this greatly in the Rules for Counterspell section in the Player's Guide, a link provided in the homebrew/legal content section.",
        "For the puroses of meeting Feat requirements, do the Fizban's dragonborn count as Dragonborns?": "It's a good question. For the purposes of LASaga and common sense, yes, they are dragonborn. By pedantic wording, you could twist they are not because they are specifically named and NOT subraces of dragonborn. Much like how the subraces of elf (e.g. high elf and drow) fit into the prerequisite of Elven Accuracy.",
        "How does having blindsight interact with the blinded condition?": "It cancels out. It's why the ones that can't be blinded (like oozes) often say 'blind beyond this radius'. They're permanently blind save for their blindsight.",
        "does the dreadful strikes feywanderer ranger feature apply to spiritual weapon?": "No it does not. Spiritual Weapon is a spell, it is only visually a weapon. You must be able to make a weapon attack in order to apply Dreadful Strikes, not a spell attack.",
        "Can imps talk whilst in beast form?": "Yep! Imps can talk even while shapechanged because the only thing about their statistics that change are their speeds! Meaning they retain language proficiencies! Also the effects of Find Familiar works as normal regardless of form.",
        "Can an item without any magical properties be cursed?": "No. But Identify cannot detect magical properties if the only magical property is it being cursed. Also Identify explicitly cannot pickup curses. Detect magic would be able to detect a magical curse though.",
        "If my character took the lucky feat and used tides of Chaos could he essentially give himself triple advantage on a roll, then use his soc reroll to get quadruple advantage? Because he gets advantage from tides, then lucky lets him roll an additional d20 (it doesn't give him advantage so the effect can stack with advantage) then if 3d20s fail he can roll an additional d20 with a soc point?": "So, this is actually a really great example of how dice replacement works. But you're effectively right. To clarify totally how it works, if you have advantage on a roll and use the lucky feat, the feature states you are effectively just choosing which of the numbers are used for the advantaged roll. For example: I have advantage and roll a 10 and a 4 on the 2d20. I then use Lucky before modifiers are applied to roll an additional 1d20 and roll a 5. Now that the 3d20 have been rolled you must choose which d20 to use for the advantaged roll (which are 2d20 taking the highest). I choose 10 and 5, discarding the 4. Assuming 10 fails, you may now reroll one of the 2d20 rolled. I roll a 15 and replace the 10 of the 10 and 5 rolled with advantage. The 15 is taken and all modifiers are applied. The same is applied with disadvantage. Lucky does not replace the entire roll, it just allows you to replace 1d20 of the 2d20 rolled for the disadvantaged roll. Magical Guidance is the same if you still failed, rerolling one die and replacing a value previously rolled.",
        "I though you didn't have to be proficient to give the help action?": "For combat yes. But for ability checks, not always. PHB p175.Sometimes two or more characters team up to attempt a task. The character who's leading the effort—or the one with the highest ability modifier—can make an ability check with advantage, reflecting the help provided by the other characters. In combat, this requires the Help action (see chapter 9). A character can only provide help if the task is one that he or she could attempt alone. For example, trying to open a lock requires proficiency with thieves' tools, so a character who lacks that proficiency can't help another character in that task. Moreover, a character can help only when two or more individuals working together would actually be productive. Some tasks, such as threading a needle, are no easier with help.",
        "How much of a body do you need for resurrection?": "Resurrection: A majority of the body to consider it 'a dead creature'. True Resurrection: Don't even need a body. It's optional.",
        "Zombies are a viable target for Dragon's Breath right?": "Yes. As is any willing creature that can take an action",
        "Okay so like I think I've confused myself. If I wanted say, a homunculus, to give me the Help action to the attack action would it need to be within 5 feet of me or my target?": "You (the one taking the Help action) must be within 5 feet of your target in order for your ally to benefit from your help."        
    },
    "LASagaRules": {
        "So how does 'applying' to go on a quest work? Do we just like put a reaction on the post and it's first come first serve or do we DM the DM and they pick who they want": "Presently, the system will work like this: - A DM posts a quest. - Players must then make replies to that quest saying they want to join. - If there are too many players, those players can either be put into another game with too few players or will unfortunately have to sit out because first-come-first-serve. The DM should not decide who is in their game, because we want to be nice and fair to everyone without bias.",
        "Okay I'm confused about the magic item loot rolls. Like are they the magic items I'm allowed to have available for players to find on the quest or are they just the magic items that become unlocked for people to buy after the quest?": "The former. They are magic items that you are allowed to include in your session as loot. Once a player finds the magic item as loot, ideally you make them find it as scraps from battle or a blueprint because they should not be able to use it or own it. You should have the players bring the looted magic item back to the Wyrmslayers so that the company can fabricate new versions of that item for purchase by the guild. You are not required to implement these magic items in your session as loot, but if you do and the players stumble across them one of your characters (of your choice) receive gold equal to one hour of gold you should distribute to your players. So you get incentive to add magic item loot and for your players to receive them",
        "Can DMs use any monster from any of the official books and how do we feel about homebrew monsters/ tweaked monsters?": "No rules on that, DMs may do whatever they want. If you enjoy using homebrew monster stats, go for it. If not, don't feel pressured",
        "Can one character take more than one quest (assuming that dates irl dont conflict)? Or do you have to make another character if you sign up for multiple quests?": "You can have a character sign up for more than one quest if you want!",
        "So uh what Tiefling subraces are actually legal? There's so many different variants for them...":  "Everything but the SCAG ones (aka just MTF ones). And PHB tiefling is just the MTF Asmodeus lineage.",
        "I was wondering if I could reskin my rapier, it wouldn't change the stats it just won't called a rapier or look like one": "Absolutely, go for it. As long as you can reference what the weapon is and it makes some level of sense",
        "DMing question. Do I as the DM of a quest have the right to say PCs don't get paid or get paid less for a quest if they don't fulfil the quest? For example, in my first quest the pcs were sent to retrieve an item for someone. They briefly considered not retrieving the item for moral reasons. If they hadn't retrieved the item could I say 'You didn't comeback with the item, the questgiver refuse to pay you' or 'The questgiver paid half upfront, but refuse to give you the 2nd half'. Or do they no matter what always get their quest gold. I thought it's best to clarify now so there isn't an argument about it later.": "Absolutely, if the players refuse the quest and don't complete it, I'd consider it to be the same way as if they died/retreated on the quest. They get no reward and fail the quest. But because they lived, I'd still give out the magic items they found.",
        "What happens if PCs die?": "You die. You need to pay or get someone else to resurrect you. There's a table for spellcasting services in the player's guide (Page 10). Pricey though, so don't die! Mercenary life is hard.",
        "I assume resurrection is only possible if the other pcs bring your body back with them/ the enemies ransome it back to the guild?": "Pretty much!",
        "Is there a reason you decided to set this little multi-DM thing in 100CA? Because setting wise there doesn't seem to be all that much going on in the background": "It's precisely because there's nothing going on in the background, it's just easier for DMs to not have to fact check everything all the time. Mostly to encourage more DMs to DM.",
        "You mentioned that certain downtime activities require a lengthy period of time. Does this mean that there's a universal time flow for the saga? do players who commit to a lengthy downtime activity have to miss out on adventures?": "Current working system is that it's irl time. The downtime system really is only in place for players that don't get to play in an adventure in a week, and can choose to dedicate their time to something productive instead. So, if you didn't adventure this week you can spend your time and money contributing to a downtime activity. If you do, but didn't complete your task, just pause it and note how much time you've spent on it",
        "so i have a character i'd like to play that's based around a specific subclass, i made her months ago but it seems like there's 2 different versions of the subclass that i swear wasn't a thing before and i specifically designed her around the one from unearthed archana, is that an issue?": "The published version of Aberrant Mind should be an easy transition, it's very similar to the UA.",
        "could i ask that you like consider the UA one? it trades a spell or 2 and telepathy for an AC ability that like i literally designed my character with.": "Unfortunately not. You can keep the flavour, but you must use the published features. No one will stop an aesthetic.",
        "This may be a silly question but: If there is a gold limit, how do we buy magical items that exceed the cap? Do we buy items (like diamonds with soecific value) and trade them in once enough is collected? Or is it as simple as us just waiting for the cap to increase at a point where we can buy the magic items?": "You can't. It's why the gold limit exists. You should spend gold if you hit the limit.",
        "is there like... some storage room somewhere full of quest rewards nobody wanted? cause looking at some of them i can't imagine that everyone kept all of them or made use of all of them": "Magic items are given to the guild to be researched and fabricated on demand. If an item is still functional it is sold or kept for research, it is isn't functional it's sold for scrap or as a historical item. Any magic item that is sold to someone is made by the guild artificer using the recovered item as a basis, so it's not the same item. Especially important if the original was made through evil means or was cursed.",
        "How does researching a topic work?": "Roll an investigation check, and a moderator (or someone relevant) will tell you what you find.",
        "If we're gonna be increasing the amount of gold people are getting, there's the possibility of people affording the +2 weapons, if you place it over a +1 enchantment do we get half the gold cost of that either back or knocked off?": "You get nothing. The new enchantment overwrites the older one. But you can cheese it by selling the old weapon for half its buying price and then buy the new one (and flavour this process as disenchantment and renchantment of the original weapon if you want). While you can cheese it, the process for overwriting a magical effect on a weapon is no easier than crafting a new weapon. You'll basically be taking your old weapon and giving it a totally different property. So no, you will need to pay the full price regardless. You can sell your old weapon and buy it back with the new enhancement, but in-universe you won't get it back for quite some time. Replacing a whole magical property is far from easy or mundane. If it sounds inconvenient, that's because it is and should be.",
        "Would characters be able to like 'source' corpses for spells at the guild, or would we have to find them on quests only?": "There are corpses that can be used for spells. There are bandits out there and they can be just brought in for use like that. Necromancy and the use of blood/corpses in magic is a thing."
    }
}
